#include <iostream>
#include<ctime>
#include<Windows.h>
using namespace std;



void fun1(int plays2, int ran);
void func(int plays1, int ran);


int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    srand(static_cast<unsigned>(time(nullptr)));
    char control = 'y';
    while (control = 'y')
    {


        int plays;//вибрати за кого ми будемо грати
        int plays1;//продавець
        int plays2;//купець
        int ran = rand() % 50000 + 20000;//бюджет

        cout << "виберіть за кого будете грати 1.продавець  2.купець:";
        cin >> plays;
        /*продавець*/
        if (plays == 1)
        {
            func(plays, ran);
            plays1 = 2;
            plays2 = 3;

        }


        if (plays == 2)
        {

        }
        cout << endl;
        cout << "запустити ще раз:";
        cin >> control;
        if (control != 'y')
        {
            break;
        }

    }



}




void fun1(int plays2, int ran)
{
    cout << "";

}










/*продавець*/

void func(int plays1, int ran)
{
    cout << endl;
    cout << "твій бюджет на сьогодні це " << ran << " грн" << endl;
    cout << "твоя задача закупити як можна більше техніки на ці гроші  " << endl;
    cout << "та продати за вигідною тобі ціною" << endl << endl;

    cout << "\t \t \t товар" << endl;

    cout << R"(1.ноутбук Lenovo IdeaPad 3 15IAU7 (82RK011NRA)
                 Arctic Grey / 15.6" IPS Full HD / Intel Core i5 - 1235U
                 RAM 16 ГБ / SSD 512 ГБ / Підсвічування клавіатури)" << endl << endl;
    cout << "\t \t \t ціна 23 499 грн" << endl << endl;



    cout << R"(2.Ноутбук Lenovo IdeaPad 1 15AMN7 (82VG00HHRA) Cloud Grey
                15.6" IPS Full HD / AMD Ryzen 3 7320U / RAM 16 ГБ / SSD 512 ГБ)" << endl << endl;
    cout << "\t \t \t ціна 18 499 грн" << endl << endl;


    cout << R"(3.Мобільний телефон Samsung Galaxy A34 6/128GB
                       Light Green (SM-A346ELGASEK))" << endl << endl;
    cout << "\t \t \t ціна 11 499 грн" << endl << endl;

    cout << "введіть номер товару:";
    cin >> plays1;

    cout << endl;





    /*код який отвічає за ноутбук і ше шось*/


    if (plays1 == 1)
    {


        if (ran >= 23499)
        {
            int c = ran - 23499;
            cout << "хороша покупка но у тебе залишилось " << c << endl;

            cout << "якщо бажаєте купити ще якійсь товар напишіть 0:";
            cin >> plays1;
        }
        int c = ran - 23499;

        if (c > 11499 || c > 12499)
        {


            if (plays1 == 0)
            {



                if (c < 23499)
                {
                    cout << endl;
                    cout << "на жаль у вас недостатньо коштів щоб купити  товар" << endl;
                    cout << "введіть номер іншого товару:";
                    cin >> plays1;

                    if (plays1 == 1)
                    {
                        switch (plays1)
                        {
                        case 2:
                            if (c >= 18499)
                            {
                                int ce = c - 18499;
                                cout << "хороша покупка но у тебе залишилось " << ce << endl;

                                if (c >= 11499)
                                {
                                    char exit;
                                    cout << "якщо хочеш купити ше якійсь товар введи його номер ящо ні то напиши n:";
                                    cin >> exit;
                                    if (exit == 'n')
                                    {
                                        cout << "ну добре(";
                                        break;
                                    }
                                }
                                cout << "введіть номер товару:";
                                cin >> plays1;
                                if (plays1 == 1 || plays1 == 2)
                                {
                                    cout << "цей товар вже був хочете ще купити його якщо так пишіть його номер ?:";
                                    cin >> plays1;

                                    if (ran >= 23499)
                                    {
                                        if (plays1 == 1)
                                        {
                                            int c = ran - 23499;
                                            cout << "тепер у вас два ноутбука але у вас залишилось " << c << " грн";
                                        }
                                    }
                                }


                            }

                        case 3:
                            if (c >= 11499)
                            {
                                int ce = c - 18499;
                                cout << "хороша покупка но у тебе залишилось " << ce << endl;
                                if (c >= 11499)
                                {
                                    char exit;
                                    cout << "якщо хочеш купити ше якійсь товар введи його номер ящо ні то напиши n:";
                                    cin >> exit;
                                    if (exit == 'n')
                                    {
                                        cout << "ну добре(";
                                        break;
                                    }


                                    cout << "введіть номер товару:";
                                    cin >> plays1;
                                    if (plays1 == 1 || plays1 == 2)
                                    {
                                        cout << "цей товар вже був хочете ще купити його якщо так пишіть його номер ?:";
                                        cin >> plays1;

                                        if (ran >= 23499)
                                        {
                                            if (plays1 == 1)
                                            {
                                                int c = ran - 23499;
                                                cout << "тепер у вас два ноутбука але у вас залишилось " << c << " грн";
                                            }
                                        }
                                    }
                                }




                            }




                        }

                    }

                }
                if (c > 23499)
                {
                    cout << "у вас є " << c << " грн що хочете купити ? введіть номер одного товару:";
                    cin >> plays1;


                    switch (plays1)
                    {
                    case 1:
                        cout << "хороша покупка у вас залишилось " << c - 23499;

                    case 2:
                        cout << "хороша покупка у вас залишилось " << c - 18499;

                    case 3:
                        cout << "хороша покупка у вас залишилось " << c - 11499;
                    }

                }
            }
        }
    }

        /*другий ноут за 18к*/
        if (plays1 == 2)
        {
            if (ran >= 18499)
            {
                int c1 = ran - 18499; /*цееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееее це отвічає за суми і тд сюдииииииииииииииииииииииииииииииииииииииииииии */
                /*цееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееее це отвічає за суми і тд сюдииииииииииииииииииииииииииииииииииииииииииии */
                cout << "хороша покупка но у тебе залишилось " << c1 << endl;
                if (c1 >= 23499 || c1 >= 11499 || c1 >= 18499)
                {
                    cout << "у вас ще залишились кошти якщо хочете ще щось купити напишіть номер товару";
                    cin >> plays1;
                    int c2 = c1;
                    switch (plays1)
                    {
                        if (c1 > 23499)
                        {
                    case 1:
                        c2 = c2 - 23499;
                        cout << "хороша покупка но у тебе залишилось " << c2;
                        break;
                        }

                        if (c1 > 18499)
                        {


                    case 2:
                        c2 = c2 - 18499;
                        cout << "хороша покупка но у тебе залишилось " << c2;
                        break;
                        }

                        if (c1 > 11499)
                        {


                    case 3:
                        c2 = c2 - 11499;
                        cout << "хороша покупка но у тебе залишилось " << c2;
                        break;
                        }
                    }
                }
                if (c1 < 11499)
                {
                    cout << "у вас мало коштів(" << endl;

                }
            }
        }

    
        else {
        cout << "у вас маловато коштів" << endl;
    }






        /*телефон        */
        if (plays1 == 3)
        {
            if (ran >= 18499)
            {
                int c1 = ran - 11499; /*цееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееее це отвічає за суми і тд сюдииииииииииииииииииииииииииииииииииииииииииии */
                /*цееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееее це отвічає за суми і тд сюдииииииииииииииииииииииииииииииииииииииииииии */
                cout << "хороша покупка но у тебе залишилось " << c1 << endl;
                if (c1 >= 23499 || c1 >= 11499 || c1 >= 18499)
                {
                    cout << "у вас ще залишились кошти якщо хочете ще щось купити напишіть номер товару:";
                    cin >> plays1;
                    int c2 = c1;
                    switch (plays1)
                    {
                        if (c2 > 23499)
                        {
                    case 1:
                        if (c1 > 23499)
                        {
                           
                            cout << "хороша покупка но у тебе залишилось " << c1 - 23499;
                            break;
                        }
                        }

                        if (c1 > 18499)
                        {


                    case 2:
                        c2 = c2 - 18499;
                        cout << "хороша покупка но у тебе залишилось " << c2;
                        break;
                        }

                        if (c1 > 11499)
                        {


                    case 3:
                        c2 = c2 - 11499;
                        cout << "хороша покупка но у тебе залишилось " << c2;
                        break;
                        }
                    }
                }
                if (c1 < 11499)
                {
                    cout << "у вас мало коштів(" << endl;

                }
            }
        }

























    }

    
     




     
 

